notifications.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ws="http://tempuri.org/ws.xsd" xmlns:wsc="http://mabservice.alcatel-lucent.com/wsc"><SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <wsc:notify>
        <wsc:notificationRequest>
            <wsc:notificationPayload>
                <wsc:notificationEntry>
                    <attributeName>event</attributeName>
                    <value>newVMSmessage</value>
                </wsc:notificationEntry>
                <wsc:notificationEntry>
                    <attributeName>folder</attributeName>
                    <value>VMS:INBOX</value>
                </wsc:notificationEntry>
                <wsc:notificationEntry>
                    <attributeName>mboxNumber</attributeName>
                    <value>4045550000</value>
                </wsc:notificationEntry>
                <wsc:notificationEntry>
                    <attributeName>webServicesVip</attributeName>
                    <value>12.230.212.20:103</value>
                </wsc:notificationEntry>
                <wsc:notificationEntry>
                    <attributeName>mboxToken</attributeName>
                    <value>4:4045550000:A:ASGCMS1:ms02:WSSOAP:33367</value>
                </wsc:notificationEntry>
                <wsc:notificationEntry>
                    <attributeName>msgType</attributeName>
                    <value>Voicemail</value>
                </wsc:notificationEntry>
                <wsc:notificationEntry>
                    <attributeName>newMsgCount</attributeName>
                    <value>2</value>
                </wsc:notificationEntry>
                <wsc:notificationEntry>
                    <attributeName>usrMsg</attributeName>
                    <value>You have 2 new messages.&#xA;</value>
                </wsc:notificationEntry>
                <wsc:notificationEntry>
                    <attributeName>uid</attributeName>
                    <value>115</value>
                </wsc:notificationEntry>
                <wsc:notificationEntry>
                    <attributeName>uidvalidy</attributeName>
                    <value>0</value>
                </wsc:notificationEntry>
            </wsc:notificationPayload>
            <wsc:clientSecuritySegment>
                <applicationID>esp</applicationID>
                <applicationPasscode>esp</applicationPasscode>
            </wsc:clientSecuritySegment>
            <wsc:clientDebugSegment>
                <MABID>alumab</MABID>
                <protocolVersion>HTTP11</protocolVersion>
                <MABVersion>8.0.0-12.10</MABVersion>
            </wsc:clientDebugSegment>
        </wsc:notificationRequest>
    </wsc:notify>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>